Script started on 2022-03-08 15:40:22-05:00 [TERM="xterm-256color" TTY="/dev/pts/52" COLUMNS="142" LINES="13"]
[?2004hdwalcot1@remote04:~/i471a/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 8.2.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [?- ['lab6-sol.pro[18G'[5G[19G[19G][4G[20G.
[1mtrue.[0m

?- [exit[[9G[K[9G][4G[10G
|    
|    .
[1;31mERROR: source_sink `exit' does not exist
ERROR: In:
ERROR:   [22] throw(error(existence_error(source_sink,exit),_18382))
ERROR:   [18] '$resolve_source_path'(exit,_18414,[expand(false),...]) at /usr/lib/swi-prolog/boot/init.pl:2318
ERROR:   [17] '$load_file'(exit,user,[expand(false),...]) at /usr/lib/swi-prolog/boot/init.pl:2292
ERROR:    [9] <user>
ERROR: 
ERROR: Note: some frames are missing due to last-call optimization.
ERROR: Re-run your program in debug mode (:- debug.) to get more detail.
[0m?- ^C
Action (h for help) ? Options:
a:           abort         b:           break
c:           continue      e:           exit
g:           goals         s:           C-backtrace
t:           trace         p:		  Show PID
h (?):       help
Action (h for help) ? exit (status 4)
[?2004hdwalcot1@remote04:~/i471a/submit/lab6$ [?2004l
exit

Script done on 2022-03-08 15:42:09-05:00 [COMMAND_EXIT_CODE="4"]
Script started on 2022-03-08 17:20:41-05:00 [TERM="xterm-256color" TTY="/dev/pts/7" COLUMNS="142" LINES="21"]
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 8.2.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- f(X, a[10G)[5G[11G = f(a, Y[20G)[15G[21G.
X = Y, Y = a.

?- f(X, a[10G)[5G[11G = f(a, X[20G)[15G[21G.
X = a.

?- f(X, a[10G)[5G[11G = f(b, X[20G)[15G[21G.
[1;31mfalse.[0m

?- f(X, Y[10G)[5G[11G = f(a, a[20G)[15G[21G, g(X, Y[29G)[24G[30G = g(a, b[39G)[34G[40G.
[1;31mfalse.[0m

?- f(1, 2, z[13G)[5G[14G = f(_, _, X[26G)[18G[27G
|    .
X = z.

?- head(a, tail(z, B[21G)[16G[22G, Y[25G)[8G[26G = head(?- head(a, tail(z, B), Y) = head(_, tail(X, _[46G)[41G[47G, _[50G)[33G[51G.
X = z.

?- cons(a, cons(b, cons(c, z[29G)[24G[30G[30G)[16G[31G[31G)[8G[32G = cons(_, cos[45G[Kns(_, cons(_, X[60G)[55G[61G[61G)[47G[62G[62G)[39G[63G.
X = z.

?- ?- cons(a, cons(b, cons(c, z))) = cons(_, cons(_, cons(_, X))).[54G[P([53G[P([52G[P([51G[P([51G[1@_(ns[46G[P([45G[P([44G[P([43G[P([43G[1@_([38G[P([37G[P([36G[P([35G[P([35G[1@_(
[1;31mERROR: Syntax error: Operator expected
ERROR: cons(a, cons(b, cons(c, z))) = 
ERROR: ** here **
ERROR: _(_, _(_, _(_, X))) . 
[0m?- ?- cons(a, cons(b, cons(c, z))) = _(_, _(_, _(_, X))).[35G[P([35G[1@c([36G[1@o([37G[1@n([38G[1@s(
[1;31mERROR: Syntax error: Operator expected
ERROR: cons(a, cons(b, cons(c, z))) = cons(_, 
ERROR: ** here **
ERROR: _(_, _(_, X))) . 
[0m?- ?- cons(a, cons(b, cons(c, z))) = cons(_, _(_, _(_, X))).[35G[3P_[55G[35G[9@cons(_, cons(_, cons[64G
X = z.

?- [a, b[9G][4G[10G.
[1;31mERROR: source_sink `a' does not exist
[0m[1;31mERROR: source_sink `b' does not exist
[0m[1mtrue.[0m

?- [a|[b[9G][b][10G][4G[11G.
[1;31mERROR: source_sink `a' does not exist
[0m[1;31mERROR: source_sink `b' does not exist
[0m[1mtrue.[0m

?- ^C
Action (h for help) ? exit (status 4)
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ [?2004l
exit

Script done on 2022-03-08 17:38:29-05:00 [COMMAND_EXIT_CODE="4"]
Script started on 2022-03-08 17:39:01-05:00 [TERM="xterm-256color" TTY="/dev/pts/7" COLUMNS="142" LINES="37"]
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ racket
[?2004lWelcome to Racket v7.9 [bc].
> ca> c[Kddr[6G[K> cd[K> c[K> [K(cddr '(1, 2, 3, 4))
'(,3 ,4)
> > (cddr '(1, 2, 3, 4))[18G 4))[K,[15G[P [12G[P 
'(3 4)
> > (cddr '(1 2 3 4))c> (c[1@ad
3
> > (caddr '(1 2 3 4))> (c[Pddd[6G[Pr[6G[1@ar
; cdar: contract violation
;   expected: (cons/c pair? any/c)
;   given: '(1 2 3 4)
; [,bt for context]
> > (cdar '(1 2 3 4))[13G[P [13G[P3[11G[P [11G[1@" [11G[P [11G[1@' [12G[1@( [13G[1@) [13G[1@1)[14G[1@ )[15G[1@2)) 
'((1 2))
> > (cdar '('(1 2) 3 4))[17G[P33[17G[1@ 33'(1 2) 3 4)))> (c[Pa
''(1 2)
> > (car '('(1 2) 3 4))> (c[1@da[23G
'((1 2))
> (exit)
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 8.2.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [1, 2, 3, 4[15G][4G[16G =[17G[K[16G = [_, _ | [X[29G][X][30G][19G[31G.
[1;31mfalse.[0m

?- ?- [1, 2, 3, 4] = [_, _ | [X]].[24G[1@, 
[1;31mERROR: Syntax error: Operand expected, unquoted comma or bar found
ERROR: [1, 2, 3, 4] = [_, _,
ERROR: ** here **
ERROR:  | [X]] . 
[0m?- ?- [1, 2, 3, 4] = [_, _, | [X]].[24G[P  | [X]]X][30G.[K[28G].[K[27G].[K[27GX].].
X = [3, 4].

?- ?- [1, 2, 3, 4] = [_, _ | X].[29G[K[28G[K[27G[K[26G[25G[K[24G[23G[K[22G[21G[K[20G[K[19G[K[_ | [_ | [X | [_[36G][_][37G][29G[38G[38G][24G[39G[39G][19G[40G.
X = 3.

?- [[1, 2,[10G[K[10G][5G[11G [11G, 3, 4[17G][4G[18G = [X | [_[28G][_][29G][21G[30G.
[1;31mfalse.[0m

?- ?- [[1, 2], 3, 4] = [X | [_]].[22G[1@[XX[24G[1@] [X]
[1;31mfalse.[0m

?- ?- [[1, 2], 3, 4] = [[X] | [_]].?- [K?- [[1, 2], 3, 4] = [[X] | [_]].[22G[2PX[31G[29G.[K[26G_].[K_].
X = [1, 2].

?- [?- ['lab6-sol.pro[18G'[5G[19G[19G][4G[20G.
[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:35: Syntax error: Unexpected end of file
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
ERROR:    No permission to modify static procedure `(=)/2'
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
ERROR:    No permission to modify static procedure `(\=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
ERROR:    No permission to modify static procedure `(\=)/2'
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
ERROR:    No permission to modify static procedure `(\=)/2'
[0m[1mtrue.[0m

?- ^C
Action (h for help) ? exit (status 4)
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ [Kdwalcot1@remote01:~/i471a/submit/lab6$ prologracketprolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 8.2.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- cdar([[1, 2[15G][10G[16G, 3, 4[22G][9G[23G[23G)[8G[24G = cdar([X | _[38G][32G[39G[39G)[31G[40G.
X = [1, 2].

?- ?- cdar([[1, 2], 3, 4]) = cdar([X | _]).?- ['lab6-sol.pro'].[K
[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:3:
ERROR:    No permission to modify static procedure `(;)/2'
ERROR:    Defined at /usr/lib/swi-prolog/boot/init.pl:370
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:4:
ERROR:    No permission to modify static procedure `(;)/2'
ERROR:    Defined at /usr/lib/swi-prolog/boot/init.pl:370
[0m[31mWarning: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
Warning:    Singleton variables: [X]
[0m[1;31mERROR: /home/dwalcot1/i471a/submit/lab6/lab6-sol.pro:5:
ERROR:    No permission to modify static procedure `(;)/2'
ERROR:    Defined at /usr/lib/swi-prolog/boot/init.pl:370
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[1mtrue.[0m

?- cdar([9G'[[1, 2[16G], 3, 4[23G][24G)
|    .
|    
|    ^C
Action (h for help) ? Options:
a:           abort         b:           break
c:           continue      e:           exit
g:           goals         s:           C-backtrace
t:           trace         p:		  Show PID
h (?):       help
Action (h for help) ? abort
[32m% Execution Aborted
[0m?- ?- ['lab6-sol.pro'].?- cdar([[1, 2], 3, 4]) = cdar([X | _]).?- ['lab6-sol.pro'].[K?- [K?- ['lab6-sol.pro'].?- cdar([[1, 2], 3, 4]) = cdar([X | _]).?- ['lab6-sol.pro'].[K?- cdar([[1, 2], 3, 4]) = cdar([X | _]).[40G[K[39G[K[38G[K[37G[K[36G[35G[K[34G[33G[K[32G[K[31G[K[30G[K[29G[K[28G[K[27G[K[26G[25G[K[24G.)[23G,).[24G ).[25GX).
X = [[[1, 2], 3, 4]|_18506].

?- [1, 2, 3, 4[15G][4G[16G = [_, _ | X[28G][19G[29G.
X = [3, 4].

?- [1, 2, 3, 4[15G][4G[16G = [_ | [_ | [X | [_[36G][_][37G][29G[38G[38G][24G[39G[39G][19G[40G.
X = 3.

?- [[1, 2[10G][5G[11G, 3, 4[17G][4G[18G = [X | _[27G][21G[28G.
X = [1, 2].

?- ^C
Action (h for help) ? Options:
a:           abort         b:           break
c:           continue      e:           exit
g:           goals         s:           C-backtrace
t:           trace         p:		  Show PID
h (?):       help
Action (h for help) ? exit (status 4)
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ [?2004l
exit

Script done on 2022-03-08 18:29:23-05:00 [COMMAND_EXIT_CODE="4"]
Script started on 2022-03-08 18:32:50-05:00 [TERM="xterm-256color" TTY="/dev/pts/7" COLUMNS="142" LINES="20"]
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 8.2.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [A|[B|C[11G][7G[12G[12G][4G[13G.
[1;31mERROR: Arguments are not sufficiently instantiated
ERROR: In:
ERROR:   [16] throw(error(instantiation_error,_16180))
ERROR:   [13] '$load_files'([_16212,_16218|_16220],user,[expand(true)]) at /usr/lib/swi-prolog/boot/init.pl:2102
ERROR:    [9] <user>
ERROR: 
ERROR: Note: some frames are missing due to last-call optimization.
ERROR: Re-run your program in debug mode (:- debug.) to get more detail.
[0m?- [a|[b|c[11G][7G[12G[12G][4G[13G.
[1;31mERROR: Type error: `list' expected, found `c' (an atom)
ERROR: In:
ERROR:   [16] throw(error(type_error(list,c),_17962))
ERROR:   [13] '$load_files'([a,b|c],user,[expand(true)]) at /usr/lib/swi-prolog/boot/init.pl:2102
ERROR:    [9] <user>
ERROR: 
ERROR: Note: some frames are missing due to last-call optimization.
ERROR: Re-run your program in debug mode (:- debug.) to get more detail.
[0m?- [a|[b[9G][b][10G][4G[11G.
[1;31mERROR: source_sink `a' does not exist
[0m[1;31mERROR: source_sink `b' does not exist
[0m[1mtrue.[0m

?- [a|b[8G][4G[9G.
[1;31mERROR: Type error: `list' expected, found `b' (an atom)
ERROR: In:
ERROR:   [16] throw(error(type_error(list,b),_22036))
ERROR:   [13] '$load_files'([a|b],user,[expand(true)]) at /usr/lib/swi-prolog/boot/init.pl:2102
ERROR:    [9] <user>
ERROR: 
ERROR: Note: some frames are missing due to last-call optimization.
ERROR: Re-run your program in debug mode (:- debug.) to get more detail.
[0m?- N = 1 + 2.
N = 1+2.

?- N is 1 + 2.
N = 3.

?- N is 1 + 2*3.
N = 7.

?- 5 is 7 mod 2.
[1;31mfalse.[0m

?- X is 7 mod 2.
X = 1.

?- X is -7 mod 3.
X = 2.

?- N is sqrt(4[15G)(4).
N = 2.0.

?- N = pi.
N = pi.

?- N is pi.
N = 3.141592653589793.

?- ^C
Action (h for help) ? exit (status 4)
[?2004hdwalcot1@remote01:~/i471a/submit/lab6$ [?2004l
exit

Script done on 2022-03-08 18:37:16-05:00 [COMMAND_EXIT_CODE="4"]
